clear all;

eps_0=8.85*10^(-12); %Электрическая постоянная
n_1=1.531-i*0.002; % комплексный показатель преломления призмы (Zeonex)
eps_1=n_1.^2; % диэлектрическая проницаемость призмы (Zeonex)
eps_2=1; % диэлектрическая проницаемость воздуха
eps_3=-14+i*700; % диэлектрическая проницаемость тонкого слоя диэлектрика на InSb 940-i*260 -15+i*700


%Параметры InSb в модели Друде Лоренца
wp=0.578*10^14; %плазменная частота (рад/с)
gp=1/5.16*10^13; %частота столкновений (рад/с)
wl=3.4*10^13; %частота Лоренца (рад/с)
gl=1/3*10^12; %Лоренцева частота столкновений (рад/с)
Al=2.02; %Амплитуда в модели Лоренца
eps0=15.86; %диэлектрическая проницаемость на бесконечности

wavelength=197*10.^(-6); %длина волны излучения
f=3*10^8/wavelength; %частота излучения
w=6.28*f; %круговая частота

%Модель Друде-Лоренца для проницаемости InSb
eps_4=eps0-wp.^2/(w.^2+i*gp*w)+Al*wl.^2/(wl^2-w.^2-i*gl*w);

%Ьодель друде для графена
d_3=35*10^(-9); %Толщина исследуемого слоя
% sigma_0=100.5*0.3*10^(-3); %Проводимость по постояному току
% tau=50*10^(-15);
% sigma=sigma_0/(1-i*w*tau);
% eps_3=1+i*sigma/(eps_0*w*d_3);

d_2=0*10^(-6):1*10^(-6):450*10^(-6); %величина зазора между призмой и InSb


teta_ext=40.7; %внешний угол падения излучения на призму

teta=45*pi/180-asin(sin((45-teta_ext)*pi/180)/real(n_1)); %угол падения в призме



% f=1.5*10^12:0.01*10^12:2*10^12;
% w=6.28*f;
% 
% %Модель Друде-Лоренца для проницаемости InSb
% for j=1:1:length(w)
%     eps(j)=eps0-wp.^2/(w(j).^2+i*gp*w(j))+Al*wl.^2/(wl^2-w(j).^2-i*gl*w(j));
% end;
% plot (f, real(eps), f, imag(eps));

%----------------------------------

%Нормальные компоненты волновых векторов (нормированные на k0)
kz_1=sqrt(eps_1)*cos(teta);
kz_2=sqrt(eps_2-eps_1*sin(teta).^2);
kz_3=sqrt(eps_3-eps_1*sin(teta).^2);
kz_4=sqrt(eps_4-eps_1*sin(teta).^2);

%Коэффициенты отражения
r_12=(eps_2*kz_1-eps_1*kz_2)/(eps_2*kz_1+eps_1*kz_2);
r_23=(eps_3*kz_2-eps_2*kz_3)/(eps_3*kz_2+eps_2*kz_3);
r_34=(eps_4*kz_3-eps_3*kz_4)/(eps_4*kz_3+eps_3*kz_4);

%Коэффициенты пропускания
t_12=2*kz_1*sqrt(eps_1*eps_2)/(eps_2*kz_1+eps_1*kz_2); %???
t_23=2*kz_2*sqrt(eps_2*eps_3)/(eps_3*kz_2+eps_2*kz_3);
t_34=2*kz_3*sqrt(eps_3*eps_4)/(eps_4*kz_3+eps_3*kz_4);

%Матрица преобразования
S1=[1/t_12 r_12/t_12; r_12/t_12 1/t_12];
S3=[exp(-i*(2*pi/wavelength)*kz_3*d_3)/t_34 r_34*exp(-i*(2*pi/wavelength)*kz_3*d_3)/t_34; r_34*exp(i*(2*pi/wavelength)*kz_3*d_3)/t_34 exp(i*(2*pi/wavelength)*kz_3*d_3)/t_34];

for j=1:1:length(d_2)
    S2=[exp(-i*(2*pi/wavelength)*kz_2*d_2(j))/t_23 r_23*exp(-i*(2*pi/wavelength)*kz_2*d_2(j))/t_23; r_23*exp(i*(2*pi/wavelength)*kz_2*d_2(j))/t_23 exp(i*(2*pi/wavelength)*kz_2*d_2(j))/t_23];
    S=S1*S2*S3;
    R(j)=abs(S(2,1)/S(1,1)).^2;
end;

plot((d_2-d_3)*10^6, R);

Data=[(d_2-d_3)*10^6; R];

fileID = fopen('R_spp_InSb-PMMA_195 um_teta-42.21.dat','w');
fprintf(fileID,'%6s %18s\n','d','R_spp');
fprintf(fileID,'%e\t%e\n',Data);
fclose(fileID);


